{
    "version": "https://jsonfeed.org/version/1",
    "title": "Khoi Can Dev",
    "description": "",
    "home_page_url": "https://khoican.dev",
    "feed_url": "https://khoican.dev/feed.json",
    "user_comment": "",
    "author": {
        "name": "Khoi Can Dev"
    },
    "items": [
        {
            "id": "https://khoican.dev/developer-thuc-dung-phan-2-phuong-phap-thuc-dung.html",
            "url": "https://khoican.dev/developer-thuc-dung-phan-2-phuong-phap-thuc-dung.html",
            "title": "Developer thực dụng - Phần 2 - Phương pháp thực dụng",
            "summary": "Bản chất của thiết kế tốtLời khuyên thứ 14: Thiết kế tốt dễ dàng thay đổi hơn thiết kế tồi Lời khuyên thứ 15: DRY - Don't repeat yourself - Đừng lặp&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1e6h690to0\">Bản chất của thiết kế tốt</a></li>\n<li><a href=\"#mcetoc_1e6jnv1dr0\">DRY - Sự trùng lặp xấu xa</a>\n<ul>\n<li><a href=\"#mcetoc_1e6jq26c11\">DRY không chỉ có trong code</a></li>\n<li><a href=\"#mcetoc_1e6jq6i8b2\">DRY trong code</a></li>\n<li><a href=\"#mcetoc_1e6jq6klt3\">Trùng lặp trong tài liệu</a></li>\n<li><a href=\"#mcetoc_1e6jq6ndn4\">Trùng lặp trong sự biểu diễn</a></li>\n<li><a href=\"#mcetoc_1e6jq6qcj5\">Trùng lặp giữa những developer</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1e6jq6spa6\">Hệ thống trực giao</a></li>\n<li><a href=\"#mcetoc_1e6jq6vhr7\">Khả năng hoàn tác</a></li>\n<li><a href=\"#mcetoc_1e6jq72lq8\">Viên đạn dẫn đường</a></li>\n<li><a href=\"#mcetoc_1e6jq75pi9\">Bản thử và ghim chú</a></li>\n<li><a href=\"#mcetoc_1e6jq78e3a\">Ngôn ngữ nghiệp vụ</a></li>\n<li><a href=\"#mcetoc_1e6jq7b5ib\">Canh đo thời gian</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1e6h690to0\">Bản chất của thiết kế tốt</h2>\n<p><strong>Lời khuyên thứ 14: Thiết kế tốt dễ dàng thay đổi hơn thiết kế tồi</strong></p>\n<ul>\n<li>Một vật được thiết kế tốt nếu nó mang lại cảm giác thuận tiện cho người sử dụng chúng. Tương tự, với code thì nó phải mang lại sự thuận tiện khi thay đổi (nguyên tắc ETC - easier to change)</li>\n<li>Mọi nguyên tắc thiết kế đều là một bản đặc biệt của ETC.\n<ul>\n<li>Như việc <strong>decoupling</strong> - tách rời những thành phần có mối quan tâm khác nhau, thì việc cập nhật những thành phần đó sẽ dễ dàng hơn.</li>\n<li>Nguyên tắc <strong>single responsibility</strong> - một thay đổi ở requirement chỉ ảnh hưởng đến một module duy nhất.</li>\n<li>Tại sao<strong> đặt tên</strong> lại quan trọng, vì những cái tên dễ hiểu sẽ làm code dễ đọc hơn, và bạn phải đọc code trước khi có thể change code.</li>\n</ul>\n</li>\n<li>Vì ETC là giá trị, không phải là luật lệ, bạn nên suy nghĩ đến ETC trước khi bắt tay làm một việc gì đó. Tự hỏi \"thứ tôi vừa làm khiến hệ thống dễ thay đổi hay khó thay đổi hơn?\". Thường thì, common sense của bạn sẽ chính xác</li>\n<li>Nếu không biết hướng đi: bạn có thể thứ (1) cố gắng làm thứ bạn xây dựng có thể thay thế - tách rời và gắn kết (2) ghi chú về những lựa chọn bạn có hiện tại, và những thay đổi có thể xảy đến, và đến khi change code, bạn có thể xem lại và nhận xét</li>\n</ul>\n<h2 id=\"mcetoc_1e6jnv1dr0\">DRY - Sự trùng lặp xấu xa</h2>\n<ul>\n<li>Kiến thức của hệ thống thường không bền và dễ bị thay đổi, có thể thay đổi sau buổi họp, hoặc nhà cầm quyền thay đổi một vài luật lệ ... Những điều này làm developer phải luôn cập nhật và điều chỉnh hệ thống lại cho phù hợp, khiến chúng ta luôn ở trong trạng thái bảo trì hệ thống</li>\n<li>Khi thực hiện những thay đổi kể trên, chúng ta rất dễ để cho sự trùng lặp kiến thức xảy ra, khiến cho việc bảo trì hệ thống biến thành ác mộng</li>\n<li>Và cách duy nhất để phát triển hệ thống một cách bền vững, dễ bảo trì và dễ hiểu, là áp dụng nguyên tắc DRY: bất kể phần kiến thức nào cũng chỉ có một nơi biểu đạt, không mơ hồ, có tính chính xác cao trong hệ thống</li>\n<li>Khi việc lặp lại xảy ra, khi thay đổi một chỗ, bạn phải nhớ thay đổi chỗ nào khác nữa. Và vấn đề chính không phải bạn có nhớ hay không, cái chính là khi nào bạn sẽ quên</li>\n<li>Và việc trùng lặp không chỉ xảy ra với code, nó còn xảy ra với các tính huống khác</li>\n</ul>\n<p><strong>Lời khuyên thứ 15: DRY - Don't repeat yourself - Đừng lặp lại chính việc mình đã làm</strong></p>\n<h3 id=\"mcetoc_1e6jq26c11\">DRY không chỉ có trong code</h3>\n<h3 id=\"mcetoc_1e6jq6i8b2\">DRY trong code</h3>\n<h3 id=\"mcetoc_1e6jq6klt3\">Trùng lặp trong tài liệu</h3>\n<h3 id=\"mcetoc_1e6jq6ndn4\">Trùng lặp trong sự biểu diễn</h3>\n<h3 id=\"mcetoc_1e6jq6qcj5\">Trùng lặp giữa những developer</h3>\n<h2 id=\"mcetoc_1e6jq6spa6\">Hệ thống trực giao</h2>\n<h2 id=\"mcetoc_1e6jq6vhr7\">Khả năng hoàn tác</h2>\n<h2 id=\"mcetoc_1e6jq72lq8\">Viên đạn dẫn đường</h2>\n<h2 id=\"mcetoc_1e6jq75pi9\">Bản thử và ghim chú</h2>\n<h2 id=\"mcetoc_1e6jq78e3a\">Ngôn ngữ nghiệp vụ</h2>\n<h2 id=\"mcetoc_1e6jq7b5ib\">Canh đo thời gian</h2>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Tóm tắt sách"
            ],
            "date_published": "2020-04-22T21:47:01+07:00",
            "date_modified": "2020-04-23T22:24:41+07:00"
        },
        {
            "id": "https://khoican.dev/course-science-of-well-being.html",
            "url": "https://khoican.dev/course-science-of-well-being.html",
            "title": "Course - Science of Well Being",
            "summary": "Week 1 - Giới thiệuKhoa học của hạnh phúc: tâm lý học tích cực và khoa học về thay đổi hành vi Hạnh phúc cũng cần phải được tập luyện Lối&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1e5q18rnp0\">Week 1 - Giới thiệu</a></li>\n<li><a href=\"#mcetoc_1e5q1956u1\">Week 2 - Những lầm tưởng về hạnh phúc</a></li>\n<li><a href=\"#mcetoc_1e6c0camv1\">Week 3 - Tại sao những mong đợi của bạn lại tệ hại</a></li>\n<li><a href=\"#mcetoc_1e6c0camv1\">Week 4 - Vượt qua thiên kiến (bias)</a></li>\n<li><a href=\"#mcetoc_1e7l62r9v1\">Week 5 - Mong muốn tốt hơn</a></li>\n<li><a href=\"#mcetoc_1e89qqltl0\">Week 6 - Chiến lược cho các thói quen tốt</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1e5q18rnp0\">Week 1 - Giới thiệu</h2>\n<p>Khoa học của hạnh phúc: tâm lý học tích cực và khoa học về thay đổi hành vi</p>\n<p>Hạnh phúc cũng cần phải được tập luyện</p>\n<p>Lối ngụy biện G.I Joe: cho rằng khi biết được điều gì đó thì đã là một nửa chặn đường. Thực tế việc \"biết\" thì chưa đủ để có thể thay đổi hành vi của bạn, nên không thể cho rằng đó là một nửa quá trình.</p>\n<p>Hạnh phúc là một quá trình cần sự chủ động cải tiến đều đặn, trong một thời gian dài</p>\n<ol>\n<li>Những lầm tưởng về hạnh phúc</li>\n<li>Tại sao những mong đợi của bạn lại tệ hại</li>\n<li>Những thứ gì làm tăng mức độ hạnh phúc</li>\n<li>Những chiến lược để tái lập lại mong chờ của bạn</li>\n<li>Tập luyện những chiến lược được nêu</li>\n</ol>\n<p>Myself:</p>\n<ul>\n<li>Top strengths: Humility, Judgment, Forgiveness, Teamwork</li>\n<li>All scores are below average</li>\n</ul>\n<h2 id=\"mcetoc_1e5q1956u1\">Week 2 - Những lầm tưởng về hạnh phúc</h2>\n<p>Tập luyện các thói quen trong tuần này</p>\n<p>Tận hưởng những điều nhỏ nhặt: mỗi ngày chọn một trải nghiệm mà bạn yêu thích, làm thêm những hoạt động để tăng cường trải nghiệm: chia sẻ cảm nhận với người khác, nhận ra mình may mắn thế nào khi có những trải nghiệm này, chụp 1 bức ảnh về trải nghiệm, tận hưởng giây phút hiện tại. Ghi lại trải nghiệm vào mỗi tối.</p>\n<p>Tỏ lòng biết ơn: nhận thấy và cảm kích về những điều được nhận trong cuộc đời. Dành 5-10 phút mỗi tối để ghi về 5 điều bạn thấy biết ơn.</p>\n<p>Những thứ bạn nghĩ sẽ mang cho bạn hạnh phúc nhưng thực tế là không</p>\n<ul>\n<li>Một công việc tốt: mức độ tụt cảm xúc sẽ không lớn nếu bạn bị từ chối công việc; không có giới hạn ở số tiền mà một người muốn có, họ sẽ muốn nhiều hơn hiện tại đang kiếm được</li>\n<li>Tiền: sau khi thỏa mãn được các nhu cầu cơ bản, ảnh hưởng của tiền tới hạnh phúc ... không đáng kể</li>\n<li>Những thứ cool ngầu: ham muốn những thứ cool ngầu và đấu tranh để đạt được nó ảnh hưởng xấu đến hạnh phúc, chủ nghĩa vật chất sẽ làm bạn thấy ít hạnh phúc hơn; tình yêu có thể làm bạn thấy hạnh phúc hơn ... trong thời gian đầu; giảm cân, thay đổi ngoại hình có xu hướng làm bạn phiền muộn hơn trong tương lai</li>\n</ul>\n<p>Những hoạt động có tính định hướng, dành nhiều công sức sẽ tác động lớn tới mức độ hạnh phúc, hơn là những đặc điểm di truyền và hoàn cảnh sống (Sonja Lyubomirsky)</p>\n<p>Chức năng phiền toái của tâm trí #1: những trực giác, cảm giác mạnh mẽ mà tâm trí đưa ra thường sai lầm</p>\n<h2 id=\"mcetoc_1e6c0camv1\">Week 3 - Tại sao những mong đợi của bạn lại tệ hại</h2>\n<p>Tập luyện các thói quen trong tuần này</p>\n<p>Hành động tốt bụng: thực hiện hành động tốt bụng có ảnh hưởng tới người khác. Ghi chú vào cuối ngày.</p>\n<p>Kết nối xã hội: thực hiện những câu chuyện trò nhỏ với người lạ, dành thời gian với những người mình có kết nối sâu sắc. Ghi chú vào cuối ngày.</p>\n<p>Miswanting: mistaken about what and how much you're going to like these things in the future. (sự nhầm lẫn về thứ bạn muốn có và cảm giác thích thú khi bạn sỡ hữu nó trong tương lai)</p>\n<p>Chức năng phiền toái của tâm trí #2: tâm trí thường không nghĩ về giá trị tuyệt đối của sự vật hiện tượng, mà chỉ suy nghĩ tương đối, dùng một giá trị mốc nào đó để so sánh. Khi so sánh tương đối, rất dễ mắc vào vấn đề so sánh mình với người khác, sẽ làm bản thân thấy ít hạnh phúc hơn. Thời đại công nghệ phát triển, có quá nhiều phương tiện khơi gợi sự so sánh này, như mạng xã hội, các chương trình truyền hình ... . Cần điều chỉnh lại bằng cách so sánh với một điểm nào gần mình nhất, như những người cùng làm việc, cùng tuổi, cùng trình độ ...</p>\n<p>Chức năng phiền toái của tâm trí #3: tâm trí hoạt động theo hướng quen dần với ngoại cảnh. Khả năng kích thích của một vấn đề giống nhau tới tâm trí sẽ giảm dần theo thời gian (hedonic adaptation)</p>\n<p>Chức năng phiền toái của tâm trí #4: tâm trí hoạt động theo hướng quen dần với ngoại cảnh. Thường đánh giá quá cao tác động xúc cảm của một sự kiện nào đó ở tương lai tới bản thân, cả về mức độ và thời gian ảnh hưởng (impact bias). Không nên quá tập trung vào 1 sự kiện tiêu cực mà quên mất những thứ xung quanh mình, để tâm trí có thể hồi phục hiệu quả.</p>\n<h2 id=\"mcetoc_1e6c0camv1\">Week 4 - Vượt qua thiên kiến (bias)</h2>\n<p>Các thói quen luyện tập trong tuần này</p>\n<p>Có ngoại hình đẹp: 30 phút tập luyện mỗi ngày có thể gây dựng được tâm trạng tốt trong ngày đó.</p>\n<p>Nghỉ ngơi đủ giấc: ngủ đủ giấc có thể cải thiện tâm trạng, cần ngủ ít nhất 7 tiếng mỗi ngày. Không sử dụng thiết bị điện tử, các chất kích thích như cà phê và rượu cồn trước khi ngủ<br><br>#1 Vượt qua cảm giác thích nghi với khoái lạc</p>\n<p>Không đầu tư vào vật chất ngay từ ban đầu, mà đầu tư vào trải nghiệm mới (du lịch, tham quan, ăn uống), bởi những trải nghiệm có tính giới hạn về thời gian, bạn sẽ appreciate nó hơn</p>\n<p>Kinh nghiệm còn mang một số lý do khác để nó tốt hơn vật chất</p>\n<ul>\n<li>Khi trò chuyện về kinh nghiệm sẽ vui hơn là trò chuyện về những thứ mình có</li>\n<li>Kinh nghiệm thường không mang nặng tính so sánh xã hội</li>\n</ul>\n<p>Trân trọng trải nghiệm đang có:</p>\n<ul>\n<li>Nói chuyện với người khác về cảm giác thích thú lúc đó</li>\n<li>Tìm người để chia sẻ</li>\n<li>Nghĩ rằng mình thật hạnh phúc</li>\n<li>Nghĩ về lúc chia sẻ điều đó cho mọi người</li>\n<li>Thể hiện ra bên ngoài</li>\n<li>Cười run</li>\n<li>Nói với bản thân rằng đang tự hào như nào</li>\n<li>Suy nghĩ về hiện tại</li>\n<li>Sống lại những trải nghiệm đẹp</li>\n</ul>\n<p>Những hành động phá hủy sự trân trọng:</p>\n<ul>\n<li>Quá tập trung vào tương lai, khi trải nghiệm kết thúc</li>\n<li>Tự nhắc mình là nó sắp kết thúc</li>\n<li>Tự bảo mình trải nghiệm này không tốt như mong đợi</li>\n<li>Nghĩ rằng không có gì là mãi mãi</li>\n<li>Nghĩ rằng sẽ không có trải nghiệm nào tốt như này nữa</li>\n<li>Nghĩ về những cách để làm trải nghiệm tốt hơn</li>\n<li>Tự bảo rằng mình không xứng đáng với trải nghiệm này</li>\n</ul>\n<p>Tưởng tượng về viễn cảnh xấu: tưởng tượng viễn cảnh mà mình không có trải nghiệm đó thì mình sẽ như thế nào.</p>\n<p>Xem hôm nay là ngày cuối của trải nghiệm: sẽ trân trọng trải nghiệm hơn</p>\n<p>Lòng biết ơn: thể hiện lòng biết ơn có tác động tích cực tới hạnh phúc</p>\n<p>#2 Đặt lại các điểm so sánh<br><br>Cụ thể hóa những điểm so sánh cũ: những trải nghiệm trước khi đạt được những cột mốc mới, bạn sẽ trân trọng những điều đang có hơn<br><br>Cụ thể hóa quan sát: quan sát những trải nghiệm tồi tệ hơn, bạn sẽ trân trọng những điều đang có hơn<br><br>Tránh việc so sánh xã hội:<br>- Khi có dấu hiệu so sánh, tự nhắc mình dừng ngay<br>- Nghĩ về những điều mình biết ơn<br>- Biết rõ những điểm so sánh mà mình tiếp nhận: chỉ tiếp nhận những điểm so sánh hợp lý<br><br>Hoãn lại việc hưởng thụ: biết về những thứ mình thích, và hưởng thụ nó một cách ngắt quãng<br><br>Gia tăng sự đa dạng của trải nghiệm</p>\n<h2 id=\"mcetoc_1e7l62r9v1\">Week 5 - Mong muốn tốt hơn</h2>\n<p>Những thói quen mới<br><br>Thiền<br>Chuyển sự chú ý tới một điểm duy nhất (hít thở, cảm giác bên trong ...) . Có thể giúp tăng tập trung, kích thích các mối quan hệ xã hội. <br><br>Cuộc viếng thăm/thư cảm ơn<br>Nghĩ về những người có ảnh hưởng lớn tới cuộc đời bạn, nhưng bạn chưa từng cảm ơn họ đúng mực. Hãy viết 1 lá thư giải thích bằng cách nào họ đã chạm đến cuộc đời bạn, và tại sao nó lại có ý nghĩa. Tốt nhất hãy dành cho họ một cuộc viếng thăm, và đọc to lá thư đó cho họ nghe.<br><br>Có sự mong muốn tốt hơn<br>#1 Sự mong muốn đúng đắn<br><br>- Một công việc 'tốt' là gì:<br>+ Khai thác tối đa tính cách tốt trong bạn (có 24 tính cách tốt theo nghiên cứu - VIA test)<br>+ Có thể đưa bạn vào 'dòng chảy': trạng thái tập trung thích thú cao độ, công việc có thử thách nhưng có thể đạt được. Để có thể vào dòng chảy, tính thử thách và những kỹ năng bạn có phải đồng bộ<br><br>- Một điểm số 'tốt' là gì:<br>+ Khi học tập, phải có động lực từ bên trong (mong muốn), không phải động lực bên ngoài (nỗi sợ, bắt buộc ...)<br>+ Nên có một tư duy rằng mọi vấn đề đều có thể được phát triển và cải thiện qua chăm chỉ và dành nhiều công sức (growth mindset), chứ không bất biến (fixed mindset)<br><br>#2 Mong muốn những điều tốt hơn<br><br>- Lòng tốt<br>+ Thực hiện những lòng tốt ngẫu nhiên hằng ngày sẽ cải thiện đc hạnh phúc<br>+ Dùng tiền để giúp đỡ người khác giúp bạn hạnh phúc hơn</p>\n<p>Kết nối xã hội<br>+ Những kết nối xã hội có tính quan trọng nhiều hơn một công việc tốt, một thành phố đáng sống, hay một người bạn đời phù hợp<br>+ Trải nghiệm một vấn đề chung với người khác thì sẽ cảm thấy thích thú vấn đề đó hơn (ăn chung, xem TV chung ...)</p>\n<p>Sung túc về mặt thời gian<br>+ Cảm thấy có đủ thời gian để làm những việc mình muốn, không cảm thấy gò bó về mặt thời gian<br>+ Người sung túc về mặt thời gian sẽ cảm thấy hạnh phúc hơn, qua đó họ cũng có nhiều thời gian hơn cho việc kết nối xã hội</p>\n<p>Kiểm soát tâm trí<br>+ Khi tâm trí không tập trung, thì dẫn đến hiện tượng tâm trí lan man, suy nghĩ về quá khứ, tương lai, về cảm giác của người khác về mình, tạo ảnh hưởng không tốt đến tâm lý<br>+ Thiền là một cách làm tăng sự tập trung, giảm sự lan man của tâm trí</p>\n<p>Những thói quen tốt<br>+ Tập thể dục, 3 lần 1 tuần, mỗi lần 30ph giúp cải thiện tâm lý, khả năng phản xạ<br>+ Ngủ, 7 tiếng 1 ngày</p>\n<h2 id=\"mcetoc_1e89qqltl0\">Week 6 - Chiến lược cho các thói quen tốt</h2>\n<p>#1 Tạo môi trường kích thích các thói quen tốt: điều chỉnh môi trường xung quanh để có thể thực hiện được nhiều hơn các thói quen tốt, và ít tạo điều kiện cho các thói quen xấu</p>\n<p> #2 Thiết lập mục tiêu<br>+ Đề ra mục tiêu: phải có định lượng, chi tiết, cụ thể<br>+ Viễn tưởng về mục tiêu: thấy được kết quả tích cực của mục tiêu, và theo đó là những rào cản gì trên con đường hiện thực hóa (mental contrasting)<br>+ Kế hoạch cho mục tiêu: thực hiện có chủ ý, đưa ra các trường hợp nếu-thì và thực hiện<br>+ Phương pháp WOOP: Wish, Outcome, Obstances, Plan</p>\n<p> </p>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Ghi chú"
            ],
            "date_published": "2020-04-11T22:25:00+07:00",
            "date_modified": "2020-05-14T21:53:53+07:00"
        },
        {
            "id": "https://khoican.dev/chung-khoan-notes.html",
            "url": "https://khoican.dev/chung-khoan-notes.html",
            "title": "Đầu tư",
            "summary": "Khái niệmBiểu đồ nếnNến tăng: xanh, điểm thấp nhất giá mở cửa, điểm cao nhất giá đóng cửa Nến đỏ: giảm, điểm cao nhất giá mở cửa, điểm thấp nhất&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1e51nnfgj0\">Khái niệm</a></li>\n<li><a href=\"#mcetoc_1e51nnhr71\">Nên đầu tư như thế nào</a></li>\n<li><a href=\"#mcetoc_1e412tde82\">Tiêu chuẩn mua vào cổ phiếu</a></li>\n<li><a href=\"#mcetoc_1e5v5e0iq1\">Tính giá trị thật &amp; giá trị cốt lõi</a></li>\n<li><a href=\"#mcetoc_1e4127lna1\">Khi nào thì bán ra</a></li>\n<li><a href=\"#mcetoc_1e66reo5a0\">Các lệnh trên sàn GD</a></li>\n<li><a href=\"#mcetoc_1e52aut4s0\">Phân tích kỹ thuật</a></li>\n<li><a href=\"#mcetoc_1e4jf6s5d0\">Phân tích cơ bản</a>\n<ul>\n<li><a href=\"#mcetoc_1ea7888bij\">Kết quả hoạt động kinh doanh</a></li>\n<li><a href=\"#mcetoc_1eafcfqq0d\">Bảng cân đối kế toán</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1e41dldrk0\">Các trang hữu ích</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1e51nnfgj0\">Khái niệm</h2>\n<table style=\"height: 777px;\" border=\"1\">\n<tbody>\n<tr style=\"height: 195px;\">\n<td style=\"height: 195px; width: 175px;\">Biểu đồ nến</td>\n<td style=\"height: 195px; width: 541px;\">Nến tăng: xanh, điểm thấp nhất giá mở cửa, điểm cao nhất giá đóng cửa<br>Nến đỏ: giảm, điểm cao nhất giá mở cửa, điểm thấp nhất giá đóng cửa<br>Đường thẳng trên: giá cao nhất trong ngày<br>Đường thẳng dưới: giá thấp nhất trong ngày</td>\n</tr>\n<tr style=\"height: 50px;\">\n<td style=\"height: 50px; width: 175px;\">Going long</td>\n<td style=\"height: 50px; width: 541px;\">Mua theo vị thế giá lên</td>\n</tr>\n<tr style=\"height: 50px;\">\n<td style=\"height: 50px; width: 175px;\">Going short</td>\n<td style=\"height: 50px; width: 541px;\">Bán theo vị thế giá xuống</td>\n</tr>\n<tr style=\"height: 79px;\">\n<td style=\"height: 79px; width: 175px;\">Giá trị vốn hóa</td>\n<td style=\"height: 79px; width: 541px;\">Giá trị vốn hóa = Giá cổ phiếu * Số cổ phiếu đang lưu hành<br>Mega cap &gt; large cap &gt; mid cap &gt; small cap &gt; micro cap</td>\n</tr>\n<tr style=\"height: 108px;\">\n<td style=\"height: 108px; width: 175px;\">Điều khiến giá CP tăng giảm</td>\n<td style=\"height: 108px; width: 541px;\">Cung và cầu, cảm xúc thị trường<br>Thị trường lạc quan: cầu &gt; cung : mua &gt; bán : giá tăng<br>Thị trường tụt giảm: cầu &lt; cung : mua &lt; bán : giá giảm</td>\n</tr>\n<tr style=\"height: 108px;\">\n<td style=\"height: 108px; width: 175px;\">Phân tích cơ bản</td>\n<td style=\"height: 108px; width: 541px;\">Phân tích giá trị, tiềm năng tăng trưởng, lợi thế cạnh tranh, dự báo tài chính ... của doanh nghiệp<br>Giá cổ phiếu sẽ tăng khi doanh nghiệp tăng giá trị</td>\n</tr>\n<tr style=\"height: 79px;\">\n<td style=\"height: 79px; width: 175px;\">Phân tích kỹ thuật</td>\n<td style=\"height: 79px; width: 541px;\">Trong ngắn hạn, thị trường được dẫn dắt bởi cảm xúc<br>Nghiên cứu biểu đồ sẽ biết được NĐT lạc quan hay bi quan</td>\n</tr>\n<tr style=\"height: 108px;\">\n<td style=\"height: 108px; width: 175px;\">Biên độ dao động</td>\n<td style=\"height: 108px; width: 541px;\">- HOSE: 7%<br>- HNX: 10%<br>- US: không có giới hạn</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"mcetoc_1e51nnhr71\">Nên đầu tư như thế nào</h2>\n<ul>\n<li>Chọn ra những công ty tốt</li>\n<li>Đầu tư khi giá chứng khoán thấp hơn giá trị thật và đang trên xu hướng tăng</li>\n<li>Chốt lời khi giá chứng khoán đảo chiều sang xu hướng giảm</li>\n<li id=\"mcetoc_1e5v56qna0\">Kết hợp 2 phương pháp: cơ bản + kỹ thuật\n<ul>\n<li>Cơ bản cho biết giá trị tiềm năng của cổ phiếu</li>\n<li>Kỹ thuật để xác định thời điểm nhà đầu tư lạc quan đủ để đẩy CP lên giá trị thật, xác định thời điểm mua CP giá rẻ</li>\n</ul>\n</li>\n<li>Đa dạng hóa đầu tư theo từng loại cổ phiếu</li>\n</ul>\n<table style=\"width: 698px;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 351.672px;\">Cổ phiếu phòng thủ</td>\n<td style=\"width: 345.328px;\">Cổ phiếu chu kỳ</td>\n</tr>\n<tr>\n<td style=\"width: 351.672px;\">- Hàng tiêu dùng, sức khỏe, DV công cộng, viễn thông, nhu cầu thiết yếu, năng lượng<br>- Vốn hóa lớn<br>- Đi lên khi kinh tế khó khăn, đi xuống khi kinh tế sôi động</td>\n<td style=\"width: 345.328px;\">- Bán đồ xa xỉ, công nghệ, nhà ở, du lịch, công nghiệp, vật liệu<br>- Tăng mạnh khi kinh tế phát triển, giảm sâu khi kinh tế khủng hoảng</td>\n</tr>\n</tbody>\n</table>\n<ul>\n<li>Nắm giữ không quá 8 - 10 CP, không mua hơn 2 CP cùng nhóm ngành</li>\n<li>Không hơn 3 cổ phiếu đảo chiều, 4 cổ phiếu có tính chu kỳ cao và công ty nhỏ tăng trưởng nhanh trong cùng một thời điểm</li>\n<li>Giữ 10% danh mục đầu tư bằng tiền mặt</li>\n<li>Phù hợp với lối sống và mức độ chịu rủi ro</li>\n<li>Xây dựng danh mục đầu tư theo chu kỳ thị trường</li>\n<li>Doanh nghiệp lớn cần theo dõi 1 tháng 1 lần, doanh nghiệp nhỏ, rủi ro, có tính chu kỳ cần theo dõi 1 tuần 1 lần</li>\n<li>Có tính kỷ luật trong việc bán ra</li>\n<li>Đặt lệnh dừng lỗ dưới giá mua khoảng 6 - 8%</li>\n<li>Bảo toàn lợi nhuận bằng cách bán ra 5% dưới đỉnh</li>\n<li>Tính quy mô đầu tư\n<ul>\n<li>% Rủi ro giao dịch: 1.5 - 3%</li>\n<li>Giá cắt lỗ = Giá cổ phiếu giảm 8% giá mua</li>\n<li>$ Rủi ro trên cổ phiếu = Giá cổ phiếu - Giá cắt lỗ</li>\n<li>Số lượng cổ phiếu = (% Rủi ro giao dịch * Vốn) / ($ Rủi ro trên cổ phiếu)</li>\n</ul>\n</li>\n<li>Đặt mục tiêu lợi nhuận bằng giá trị thật của cổ phiếu hoặc ngưỡng kháng cự kế tiếp (dùng số thấp hơn)</li>\n<li>Tỷ lệ rủi ro - lợi nhuận ít nhất 1:2. R-Multiple &gt;= 2R</li>\n</ul>\n<h2 id=\"mcetoc_1e412tde82\">Tiêu chuẩn mua vào cổ phiếu</h2>\n<table border=\"1\">\n<tbody>\n<tr>\n<td>Doanh số (revenue), lợi nhuận (income) và dòng tiền tăng ổn định trong quá khứ</td>\n<td>Giá trị công ty và giá cổ phiếu sẽ tăng dần theo thời gian</td>\n</tr>\n<tr>\n<td>Lợi thế cạnh tranh bền vững</td>\n<td>Có hào kinh tế rộng<br>- Thương hiệu mạnh, phổ biến, có tính biểu tượng, người mua trung thành<br>- Quy mô khổng lồ<br>- Dẫn đầu thị trường<br>- Bằng sáng chế đặc biệt<br>- Chi phí chuyển đổi cao để giữ chân khách hàng<br>- Nắm giữ thế độc quyền<br>Biên lợi nhuận gộp (GP) &amp; biên lợi nhuận ròng (NP) phải cao hơn các đối thủ cạnh tranh</td>\n</tr>\n<tr>\n<td>Các yếu tố thúc đẩy tăng trưởng trong tương lai</td>\n<td>Thị trường tiêu thụ sản phẩm của công ty phát triển theo hướng có lợi cho công ty<br>Có kế hoạch tăng trưởng vững chắc<br>- Phát triển sản phẩm mới, có tính đột phá<br>- Sáng chế mới<br>- Mở rộng quy mô<br>- Mở ra thị trường mới<br>Tìm ở báo cáo thường niên, báo cáo phân tích, tỷ lệ tăng trưởng dài hạn dự đoán (LT Growth Rate)</td>\n</tr>\n<tr>\n<td>Nợ trong khả năng chi trả</td>\n<td>Số nợ dài hạn (long term debt) ít hơn 3 lần so với thu nhập ròng ngắn hạn (net income)<br>Không áp dụng cho ngân hàng và công ty hàng hóa có mức nợ cao</td>\n</tr>\n<tr>\n<td>Lợi nhuận trên vốn chủ sở hữu (ROE) phải luôn trên mức trung bình (15%)</td>\n<td>Return of equity = lợi nhuận ròng sau thuế / tổng số vốn của cổ đông * 100%<br>Có nghĩa: công ty có lợi thế cạnh tranh bền vững, khoản đầu tư của cổ đông sẽ tăng trưởng với tỷ lệ kép hằng năm cao, khiến giá cổ phiếu tăng cao trong tương lai</td>\n</tr>\n<tr>\n<td>Ban lãnh đạo đang nắm giữ hoặc mua cổ phiếu công ty</td>\n<td> </td>\n</tr>\n<tr>\n<td>Giá thấp hơn giá trị thật, giá cổ phiếu đảo chiều sang xu hướng tăng</td>\n<td>Giá cổ phiếu &lt; Giá trị cốt lõi<br>Khi có tin tức xấu, thị trường hoảng sợ<br>Đừng bao giờ cô bắt lấy con dao đang rơi</td>\n</tr>\n<tr>\n<td>Hệ số PE, EGR, PEG</td>\n<td>PE nên bằng ERG (earning growth rate - hệ số tăng trưởng lợi nhuận)<br>PEG = PE / EGR<br>PEG ~ 1: giá CP hợp lý<br>PEG &gt; 1: giá CP mắc<br>PEG &lt; 1: giá CP rẻ</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"mcetoc_1e5v5e0iq1\">Tính giá trị thật &amp; giá trị cốt lõi</h2>\n<ul>\n<li>Dự đoán dòng tiền của doanh nghiệp trong 10 năm tới\n<ul>\n<li>Ghi lại dòng tiền mặt từ hoạt động kinh doanh theo khung 12 tháng, tỷ lệ tăng trưởng dài hạn</li>\n<li>Tính dòng tiền dự đoán theo từng năm</li>\n</ul>\n</li>\n<li>Tính hệ số chiết khấu (Discount Factor - DF) phù hợp\n<ul>\n<li>Kiểm tra giá trị beta: lớn hơn 1 là cổ phiếu có tính biến động cao hơn chỉ số chung của thị trường, nhỏ hơn 1 là cổ phiếu có tính biến động thấp hơn</li>\n<li>\n<table>\n<tbody>\n<tr>\n<td>Beta</td>\n<td>Tỷ lệ chiết khấu</td>\n</tr>\n<tr>\n<td>Nhỏ hơn 0.80</td>\n<td>5%</td>\n</tr>\n<tr>\n<td>1</td>\n<td>6%</td>\n</tr>\n<tr>\n<td>1.1</td>\n<td>6.8%</td>\n</tr>\n<tr>\n<td>1.2</td>\n<td>7%</td>\n</tr>\n<tr>\n<td>1.3</td>\n<td>7.9%</td>\n</tr>\n<tr>\n<td>1.4</td>\n<td>8%</td>\n</tr>\n<tr>\n<td>1.5</td>\n<td>8.9%</td>\n</tr>\n<tr>\n<td>Lớn hơn 1.6</td>\n<td>9%</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Hệ số chiết khấu (DF) = 1 / tỷ lệ chiết khấu ^ n (n = số năm)</li>\n</ul>\n</li>\n<li>Chiết khấu tất cả dòng tiền tương lai thành giá trị hiện tại (DV) và lấy tổng cộng\n<ul>\n<li>Tính giá trị chiết khấu (DV) bằng cách nhân dòng tiền dự đoán với hệ số chiết khấu (DF)</li>\n<li>Tổng giá trị chiết khấu (DV) của 10 năm là giá trị thật của doanh nghiệp (PV)</li>\n</ul>\n</li>\n<li>Tìm giá trị thật của cổ phiếu\n<ul>\n<li>Giá trị thật của một cổ phiếu = PV / số lượng cổ phiếu đang lưu hành</li>\n<li>Giá trị bù = (Tiền mặt và các khoản tương đương - Tổng nợ) / số lượng CP đang lưu hành</li>\n<li>Giá trị thật chính xác hơn = Giá trị thật của một cổ phiếu - Giá trị bù</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"mcetoc_1e4127lna1\">Khi nào thì bán ra</h2>\n<ul>\n<li>Cổ phiếu đảo chiều sang xu hướng giảm</li>\n<li>Cơ cấu tổ chức điều hành công ty có sự xáo trộn</li>\n<li>Lợi nhuận giảm sút liên tục 2-3 quý</li>\n<li>Thị giá cổ phiếu lớn hơn nhiều lần so với giá trị thực</li>\n<li>Không còn lý do để lựa chọn cổ phiếu đó</li>\n<li>Sự hài lòng đối với danh mục đầu tư hiện tại không còn nữa</li>\n</ul>\n<h2 id=\"mcetoc_1e66reo5a0\">Các lệnh trên sàn GD</h2>\n<ul>\n<li>ATO: mua hoặc bán ở mức giá mở cửa (mua trần bán sàn) (ít dùng ~ 5%)</li>\n<li>ATC: mua hoặc bán ở mức giá đóng cửa (mua trần bán sàn) (ít dùng ~ 5%)</li>\n<li>LO: mua hoặc bán ở 1 mức giá xác định hoặc tốt hơn (95%)</li>\n<li>MP: mua hoặc bán ở mức giá thấp nhất / cao nhất trên thị trường (ít dùng)</li>\n</ul>\n<h2 id=\"mcetoc_1e52aut4s0\">Phân tích kỹ thuật</h2>\n<ul>\n<li>Xác định xu hướng giá cổ phiếu\n<ul>\n<li>Xu hướng tăng: tạo đỉnh cao hơn, đáy cao hơn, vẽ đường đường hỗ trợ ở các đáy, đường hỗ trợ chạm giá CP càng nhiều thì càng mạnh</li>\n<li>Xu hướng giảm: tạo đỉnh thấp hơn, đáy thấp hơn, vẽ đường kháng cự ở các đỉnh, đường kháng cự chạm giá CP càng nhiều thì càng mạnh</li>\n<li>Ổn định đi ngang: đi ngang giữa mức giá cao hơn và mức giá thấp hơn, chưa thể kiếm tời từ những CP ổn định</li>\n</ul>\n</li>\n<li>Sử dụng đường trung bình động (Moving Average) để xác định sự thay đổi trong xu hướng\n<ul>\n<li>MA 150 cắt trên MA 50 là xu hướng giảm</li>\n<li>MA 150 cắt dưới MA 50 là xu hướng tăng</li>\n<li>MA ngắn hơn có thể dùng để nắm bắt xu hướng ngắn hạn hơn</li>\n</ul>\n</li>\n<li>Khi CP có thể bứt phá lên trên đường kháng cự mạnh: động lượng hướng lên của đợt tăng giá, <strong>thời điểm tốt để mua CP, </strong>điểm mua an toàn là điểm giảm giá sau khi phá vỡ đường kháng cự, đường kháng cự có thể hỗ trợ cho giá CP</li>\n<li>Kiếm thật nhiều khi bạn đúng và thua lỗ một ít khi bạn sai, quan trọng là biết quản lý rủi ro</li>\n<li>Đặt lệnh dừng lỗ (stop loss): dưới đường hỗ trợ mới một cây nến</li>\n</ul>\n<h2 id=\"mcetoc_1e4jf6s5d0\">Phân tích cơ bản</h2>\n<h3 id=\"mcetoc_1ea7888bij\">Kết quả hoạt động kinh doanh</h3>\n<ul>\n<li>Được công bố vào mỗi quý và cuối năm, phản ảnh tình hình DN ở thời điểm đó</li>\n<li>Gồm 3 phần: doanh thu, chi phí, lãi lỗ</li>\n</ul>\n<table style=\"border-collapse: collapse; width: 100%; height: 175px;\" border=\"1\">\n<tbody>\n<tr style=\"height: 49px;\">\n<td style=\"width: 22.9717%; height: 49px;\">Mục</td>\n<td style=\"width: 25.2688%; height: 49px;\">Ý nghĩa</td>\n<td style=\"width: 33.3333%; height: 49px;\">Phân tích</td>\n</tr>\n<tr style=\"height: 77px;\">\n<td style=\"width: 22.9717%; height: 77px;\">Doanh thu thuần</td>\n<td style=\"width: 25.2688%; height: 77px;\">Tổng số tiền thu được</td>\n<td style=\"width: 33.3333%; height: 77px;\">Không có nhiều ý nghĩa</td>\n</tr>\n<tr style=\"height: 49px;\">\n<td style=\"width: 22.9717%; height: 49px;\">Giá vốn hàng bán</td>\n<td style=\"width: 25.2688%; height: 49px;\">Chi phí của DN</td>\n<td style=\"width: 33.3333%; height: 49px;\">\n<ul>\n<li>Chi phí mua hàng hóa</li>\n<li>Vật liệu</li>\n<li>Nhân công</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Lợi nhuận gộp</td>\n<td style=\"width: 25.2688%;\">Khác biệt giũa doanh thu thuần và giá vốn hàng bán</td>\n<td style=\"width: 33.3333%;\">Tính ra được tỷ suất / biên lợi nhuận gộp: LNG / DTT<br>Những DN có LTCT có biên lợi nhuận gộp cao &gt;= 40%<br>Khi &lt; 40% nghĩa là DN đang hoạt động trong ngành có tính cạnh tranh cao<br>- Chi phí nghiên cứu lớn<br>- Chi phí bán hàng, quản lý lớn<br>- Chi phí tiền lãi cao</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Chi phí bán hàng &amp; quản lý KD</td>\n<td style=\"width: 25.2688%;\">Lương, quảng cáo, đi lại, phí pháp lý, hoa hồng, chi phí lương ...</td>\n<td style=\"width: 33.3333%;\">Phải nhất quán, tỷ lệ dao động nhỏ (chi phí / lợi nhuận gộp)<br>Tỉ lệ tốt từ 30~80%</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Chi phí nghiên cứu và phát triển *</td>\n<td style=\"width: 25.2688%;\"> </td>\n<td style=\"width: 33.3333%;\">Những DN dựa vào sáng chế và lợi thế công nghệ thường không bền vững về lâu dài</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Chi phí khấu hao</td>\n<td style=\"width: 25.2688%;\"> </td>\n<td style=\"width: 33.3333%;\">Chi phí khấu hao / LNG thấp: &lt;= 10%</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Chi phí lãi vay</td>\n<td style=\"width: 25.2688%;\">Phần tiền lãi đã chi trả, trong cả quý hoặc cả năm, cho số nợ xuất hiện trên bảng CĐKT</td>\n<td style=\"width: 33.3333%;\">Tỷ lệ lãi vay phải trả so với thu nhập từ HĐKD thấp là DN có lợi thế cạnh tranh</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Lãi/lỗ do thanh lý tài sản *</td>\n<td style=\"width: 25.2688%;\">Ghi nhận khi bán tài sản không phải hàng tồn kho</td>\n<td style=\"width: 33.3333%;\"> </td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Lợi nhuận khác</td>\n<td style=\"width: 25.2688%;\">Tiền thanh lý TSCĐ (đất đai nhà xưởng)<br>Hợp đồng bản quyền</td>\n<td style=\"width: 33.3333%;\">Nên tách mục này ra khỏi lợi nhuận thuần khi xác định DN có lợi thế cạnh tranh</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Lợi nhuận trước thuế</td>\n<td style=\"width: 25.2688%;\">Thu nhập của DN sau khi trừ hết chi phí<br>Chưa trừ thuế TNDN</td>\n<td style=\"width: 33.3333%;\">Dùng để tính toán lợi nhuận khi mua CP</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Thuế thu nhập doanh nghiệp</td>\n<td style=\"width: 25.2688%;\"> </td>\n<td style=\"width: 33.3333%;\">Nên phản ánh đúng lợi nhuận trước thuế</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Lợi nhuận thuần</td>\n<td style=\"width: 25.2688%;\">Thu nhập của DN sau khi trừ chi phí và thuế</td>\n<td style=\"width: 33.3333%;\">Nên thể hiện xu hướng tăng trưởng từ trước đến giờ<br>Tỷ lệ LNT / tổng doanh thu: <br>- cao thể hiện lợi thế cạnh tranh bền vững<br>- thấp thể hiện ngành hoạt động có tính cạnh tranh cao, hoặc đó là ngân hàng hoặc các công ty tài chính (dùng đòn bẩy / rủi ro để kiếm lợi nhuận)</td>\n</tr>\n<tr>\n<td style=\"width: 22.9717%;\">Thu nhập trên mỗi CP (EPS)</td>\n<td style=\"width: 25.2688%;\">EPS = lợi nhuận thuần / CP đang lưu hành</td>\n<td style=\"width: 33.3333%;\">Cần có sự nhất quán và xu hướng tăng trưởng EPS trong 10 năm<br>Thể hiện DN đang bán sản phẩm không cần phải chi nhiều để cải tiến, thay đổi<br>Có lợi thế KT đủ mạnh để dành chi phí quảng cáo sản phẩm, mở rộng sản xuất</td>\n</tr>\n</tbody>\n</table>\n<p>* : không có trong mẫu KQKD của VN</p>\n<h3 id=\"mcetoc_1eafcfqq0d\">Bảng cân đối kế toán</h3>\n<p>Là ảnh chụp ở một thời điểm cụ thể (cuối quý / cuối năm)</p>\n<p>Bao gồm tài sản và nợ (ngắn hạn, dài hạn) và vốn chủ sở hữu</p>\n<p>Nợ ngắn hạn: tiền nợ trong vòng 1 năm - bù đắp cho các khoản Tiền mặt và Các khoản đầu tư ngắn hạn, Tổng hàng tồn kho, Tổng các khoản phải thu và Chi phí trả trước</p>\n<p>Nợ dài hạn: nợ đến hạn trong 1 năm hoặc lâu hơn - tiền nợ NCC hàng hóa, thuế chưa trả, tiền vay ngân hàng và các khoản nợ trái phiếu</p>\n<p>Giá trị tài sản ròng (vốn chủ sở hữu) = Tài sản - nợ</p>\n<p>Vòng quay tài sản lưu động: Tiền mặt - Tồn kho - Các khoản phải thu - Tiền mặt</p>\n<table style=\"border-collapse: collapse; width: 100%;\" border=\"1\">\n<tbody>\n<tr>\n<td style=\"width: 33.3333%;\">Mục</td>\n<td style=\"width: 33.3333%;\">Ý nghĩa</td>\n<td style=\"width: 33.3333%;\">Phân tích</td>\n</tr>\n<tr>\n<td style=\"width: 33.3333%;\">Tài sản</td>\n<td style=\"width: 33.3333%;\"> </td>\n<td style=\"width: 33.3333%;\"> </td>\n</tr>\n<tr>\n<td style=\"width: 33.3333%;\">Tài sản lưu động</td>\n<td style=\"width: 33.3333%;\">Tiền mặt hoặc có thể được chuyển thành tiền mặt trong khoảng thời gian rất ngắn (trong vòng 1 năm)<br>Liệt kê trên bảng CĐKT theo thứ tự thanh khoản</td>\n<td style=\"width: 33.3333%;\"> </td>\n</tr>\n<tr>\n<td style=\"width: 33.3333%;\">Các tài sản khác</td>\n<td style=\"width: 33.3333%;\">Không lưu động, không hoặc không thể chuyển đổi thành tiền mặt trong vòng 1 năm sắp tới</td>\n<td style=\"width: 33.3333%;\"> </td>\n</tr>\n<tr>\n<td style=\"width: 33.3333%;\">Tiền mặt và các khoản tương đương</td>\n<td style=\"width: 33.3333%;\">Tiền và các khoản tương đương tiền như: chứng chỉ tiền gửi ngắn hạn, trái phiếu kho bạc thời hạn 3 tháng, tài sản có tính thanh khoản cao khác</td>\n<td style=\"width: 33.3333%;\">\n<p>Điều tốt khi mục này cao do DN tạo ra nhiều tiền mặt từ hoạt động kinh doanh, it hoặc không có nợ, có ngành tạo ra nhiều tiền mặt hơn chi phí</p>\n<p>Nếu cao do bán một ngành kinh doanh, hoặc bán lượng lớn trái phiếu, là điều không tốt</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 33.3333%;\">Hàng tồn kho</td>\n<td style=\"width: 33.3333%;\">Nhưng sản phẩm DN mua bán</td>\n<td style=\"width: 33.3333%;\">\n<p>Điều tốt khi: lượng hàng tồn kho và lợi nhuận tăng trưởng tương ứng</p>\n</td>\n</tr>\n</tbody>\n</table>\n<table border=\"1\">\n<tbody>\n<tr>\n<td>Tỷ số thanh toán hiện hành (Current ratio)</td>\n<td>Lớn hơn 1</td>\n</tr>\n<tr>\n<td>Tỷ số thanh toán nhanh (Quick ratio)</td>\n<td>Lớn hơn 1</td>\n</tr>\n<tr>\n<td>Khả năng thanh toán lãi vay</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tỷ số Nợ vay trên Tổng tài sản</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tỷ số Vốn chủ sở hữu trên Tổng tài sản</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tài sản ngắn hạn/Tổng tài sản</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tài sản dài hạn/Tổng tài sản</td>\n<td> </td>\n</tr>\n<tr>\n<td>Vòng quay hàng tồn kho</td>\n<td>Chỉ số càng lớn thể hiện hàng hóa luân chuyển nhanh, lưu kho thấp<br>Cần so sánh với chỉ số trung bình trong ngành</td>\n</tr>\n<tr>\n<td>Thời gian tồn kho bình quân</td>\n<td> </td>\n</tr>\n<tr>\n<td>Vòng quay phải thu khách hàng</td>\n<td> </td>\n</tr>\n<tr>\n<td>Thời gian thu tiền khách hàng bình quân</td>\n<td>Cần xem xét trong mối liên hệ với các thông tin khác. Nếu chính sách là bán chịu trong 38 ngày thì vòng quay 45 ngày cho thấy cty đang gặp khó khăn trong việc thu nợ đúng hạn.</td>\n</tr>\n<tr>\n<td>Thời gian trả tiền khách hàng bình quân</td>\n<td> </td>\n</tr>\n<tr>\n<td>Vòng quay tài sản cố định (Hiệu suất sử dụng tài sản cố định)</td>\n<td> </td>\n</tr>\n<tr>\n<td>Vòng quay tổng tài sản (Hiệu suất sử dụng toàn bộ tài sản)</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tỷ suất sinh lợi trên tổng tài sản bình quân (ROAA)</td>\n<td> </td>\n</tr>\n<tr>\n<td>Tỷ suất lợi nhuận trên vốn chủ sở hữu bình quân (ROEA)</td>\n<td> </td>\n</tr>\n<tr>\n<td>Thu nhập trên mỗi cổ phần (EPS)</td>\n<td>Chỉ số về hiệu quả hoạt động của công ty</td>\n</tr>\n<tr>\n<td>Chỉ số giá thị trường trên thu nhập (P/E)</td>\n<td>- Nhà đầu tư phải trả giá cho một đồng lợi nhuận bao nhiêu<br>- Cần so sánh với PE cùng ngành<br>- EPS quá thấp sẽ đẩy PE lên cao, giá trị CP không đảm bảo<br>- Chỉ số có thể bị thao túng nếu công ty công bố lãi nhiều hơn thực tế<br>- Cần xem xét P/E tương lai<br>- Giá trị 8-15 bình thường, &gt; 20 được đánh giá tốt, &lt; 8 không đánh giá cao hoặc chưa có hiểu biết nhiều</td>\n</tr>\n<tr>\n<td>Chỉ số giá thị trường trên giá trị sổ sách (P/B)</td>\n<td>P/B lớn hơn 1 thì công ty đang làm ăn khá tốt và thu nhập trên tài sản cao</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"mcetoc_1e41dldrk0\">Các trang hữu ích</h2>\n<ul>\n<li><a href=\"https://finance.vietstock.vn/doanh-nghiep-a-z?page=1\">Vietstock - Company info</a></li>\n<li><a href=\"https://www.investing.com/\">Investing - Company info</a></li>\n<li><a href=\"http://chungkhoanvn.vn/cac-chi-so-tai-chinh-trong-phan-tich-co-ban-chung-khoan/\">Phân tích các chỉ số</a></li>\n</ul>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Ghi chú"
            ],
            "date_published": "2020-03-22T03:10:06+07:00",
            "date_modified": "2020-06-10T23:11:08+07:00"
        },
        {
            "id": "https://khoican.dev/ten-dev-thuc-dung-phan-1-triet-ly-thuc-dung-mo-dau.html",
            "url": "https://khoican.dev/ten-dev-thuc-dung-phan-1-triet-ly-thuc-dung-mo-dau.html",
            "title": "Developer thực dụng - Phần 1 - Triết lý thực dụng",
            "summary": "Đó là cuộc đời của bạnHãy thay đổi khi bạn thấy không ổnKiến thức ngành dev không bị giới hạn bởi văn hóa và giới hạn vật lýNgành dev là một&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1e3n0gd4q1\">Đó là cuộc đời của bạn</a></li>\n<li><a href=\"#mcetoc_1e3n1o2cr2\">Con mèo ăn code của tôi rồi</a>\n<ul>\n<li><a href=\"#mcetoc_1e3n2eekg3\">Lòng tin trong đội nhóm</a></li>\n<li><a href=\"#mcetoc_1e3n2n9s54\">Lãnh trách nhiệm</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1e3s9vqke0\">Thuyết hỗn loạn của phần mềm</a></li>\n<li><a href=\"#mcetoc_1e46gk2fu0\">Nồi súp đá cuội và con ếch luộc</a></li>\n<li><a href=\"#mcetoc_1e493jaj40\">Một chương trình đủ tốt</a></li>\n<li><a href=\"#mcetoc_1e4e9n9140\">Danh mục tri thức</a>\n<ul>\n<li><a href=\"#mcetoc_1e4eb0ach1\">Đầu tư định kỳ</a></li>\n<li><a href=\"#mcetoc_1e4eb0j1v2\">Đa dạng hóa</a></li>\n<li><a href=\"#mcetoc_1e4eb0vba3\">Quản lý rủi ro</a></li>\n<li><a href=\"#mcetoc_1e4eb190j4\">Mua thấp, bán cao</a></li>\n<li><a href=\"#mcetoc_1e4eb1l7g5\">Xem xét và tái cân bằng</a></li>\n<li><a href=\"#mcetoc_1e4r74lt90\">Những mục tiêu</a></li>\n<li><a href=\"#mcetoc_1e4r755bd1\">Cơ hội học hỏi</a></li>\n<li><a href=\"#mcetoc_1e4r7i50l2\">Suy nghĩ phản biện</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1e52qg4f00\">Giao tiếp</a>\n<ul>\n<li><a href=\"#mcetoc_1e52r964h1\">Hiểu thính giả của bạn</a></li>\n<li><a href=\"#mcetoc_1e52r9jn52\">Biết mình nên nói những gì</a></li>\n<li><a href=\"#mcetoc_1e52ra0jd3\">Chọn thời điểm</a></li>\n<li><a href=\"#mcetoc_1e52ra7cu4\">Chọn cách thức</a></li>\n<li><a href=\"#mcetoc_1e52ravpo5\">Trình bày tài liệu chỉnh chu</a></li>\n<li><a href=\"#mcetoc_1e52rco236\">Cho phép người đọc tham gia vào việc chuẩn bị</a></li>\n<li><a href=\"#mcetoc_1e52rd93j7\">Biết lắng nghe</a></li>\n<li><a href=\"#mcetoc_1e52rebu68\">Trả lời thắc mắc</a></li>\n<li><a href=\"#mcetoc_1e52rek5v9\">Làm tài liệu</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1e3n0gd4q1\">Đó là cuộc đời của bạn</h2>\n<ul>\n<li>Hãy thay đổi khi bạn thấy không ổn</li>\n<li>Kiến thức ngành dev không bị giới hạn bởi văn hóa và giới hạn vật lý</li>\n<li>Ngành dev là một ngành có thể mang lại cơ hội và sự kiểm soát cao nhất cho bạn, hãy chủ động nắm lấy</li>\n</ul>\n<p><strong>Lời khuyên thứ 3: Bạn có quyền tự quyết</strong></p>\n<h2 id=\"mcetoc_1e3n1o2cr2\">Con mèo ăn code của tôi rồi</h2>\n<h3 id=\"mcetoc_1e3n2eekg3\">Lòng tin trong đội nhóm</h3>\n<ul>\n<li>Những người trong nhóm cần có thể tin tưởng và dựa vào bạn, cũng như bạn cũng tin tưởng và dựa vào họ.</li>\n<li>Đó là điều kiện tiên quyết cho việc sáng tạo và làm việc nhóm</li>\n<li>Ở một môi trường lành mạnh dựa vào lòng tin, bạn có thể <strong>yên tâm</strong> trình bày những suy nghĩ của mình</li>\n</ul>\n<h3 id=\"mcetoc_1e3n2n9s54\">Lãnh trách nhiệm</h3>\n<ul>\n<li>Lãnh trách nhiệm cần có sự <strong>chủ động chấp nhận</strong> của bạn</li>\n<li>Cần đánh giá tình hình để nhận ra những nguy cơ nằm ngoài tầm của bạn</li>\n<li>Bạn có quyền <strong>không </strong>lãnh trách nhiệm cho một vấn đề bất khả thi, hoặc có nguy cơ quá cao</li>\n<li>Khi đã chấp nhận lãnh tránh nhiệm, thì bạn là người chịu trách nhiệm chính</li>\n<li>Khi có vấn đề xảy ra, hãy thành thực nhận lỗi và đưa ra những phương án giải quyết</li>\n<li>Ngưng đổ lỗi, ngưng ngụy biện, nhiệm vụ của bạn là đưa ra những phương án giải quyết</li>\n<li>Hãy có phương án dự phòng cho những vấn đề nằm ngoài tầm kiểm soát</li>\n<li>Hãy thử giải thích cho con rubber duck trong tay, xem thử ý kiến của bạn có hợp lý hay ngu ngốc</li>\n</ul>\n<p><strong>Lời khuyên thứ 4: Hãy đề ra những phương án, dừng kiến tạo ngụy biện</strong></p>\n<h2 id=\"mcetoc_1e3s9vqke0\">Thuyết hỗn loạn của phần mềm</h2>\n<ul>\n<li>Sự hỗn loạn trong vũ trụ thường hướng đến cực điểm</li>\n<li>Tương tự, hỗn loạn trước sau gì cũng xảy ra trong phần mềm, khi hỗn loạn xảy ra, ta gọi đó là <strong>tech debt</strong>, hoặc <strong>software rot</strong></li>\n<li>Nhiều yếu tố cấu thành: tâm lý, văn hóa trong công việc hay dự án</li>\n<li>Yếu tố kích hoạt: theo thuyết một cửa sổ hỏng, sự vô vọng có tính lây lan</li>\n<li>Làm lơ sự hư hỏng dễ củng cố suy nghĩ, rằng, vấn đề đó không thể sửa chữa, không có ai quan tâm nữa, suy nghĩ tiêu cực này sẽ lây lan trong nhóm</li>\n</ul>\n<p><strong>Lời khuyên thứ 5: Đừng sống chung với những cửa sổ hỏng</strong></p>\n<ul>\n<li>Sửa chúng ngay khi phát hiện, nếu không có thời gian, hãy ghim lên bảng trắng</li>\n<li>Việc bỏ lơ làm gia tăng tốc độ hư hỏng nhanh nhất</li>\n<li>Nếu ai cũng cho rằng không có thời gian để dọn dẹp, thì hãy chuẩn bị sẵn một xe rác bự, hoặc chuyển qua nơi làm khác, đừng để sự hỗn loạn thắng thế</li>\n<li><strong>Điều đầu tiên: Đừng làm điều ác</strong></li>\n<li>Đừng tạo ra tổn thất, hư hại chỉ vì đang giải quyết một vấn đề cấp bách</li>\n<li>Trong một dự án mà code được viết gọn gàng, sạch sẽ, sẽ tạo ra tâm lý đây là những thứ nên được chăm sóc, không làm tổn hại</li>\n</ul>\n<h2 id=\"mcetoc_1e46gk2fu0\">Nồi súp đá cuội và con ếch luộc</h2>\n<ul>\n<li><a href=\"https://www.wattpad.com/401458-c%C3%A2u-chuy%E1%BB%87n-m%C3%B3n-s%C3%BAp-%C4%91%C3%A1\">Câu chuyện về món súp đá</a></li>\n<li>Bạn thấy được những thay đổi, thiết kế mới là cần thiết, nhưng để được thông qua là điều không dễ dàng. Lúc này, bạn nên làm tốt nhất những gì trong tầm được cho phép, cho mọi người thấy và để họ trầm trồ.</li>\n<li>Khi đã hứng khởi, bạn sẽ mời chào rằng 'nếu thêm tính năng abc này thì sẽ hay hơn đó'</li>\n<li>Đám đông sẽ dễ hưởng ứng theo thành công bước đầu</li>\n</ul>\n<p><strong>Lời khuyên thứ 6: Hãy là chất xúc tác cho sự thay đổi</strong></p>\n<ul>\n<li>Không nên quá chăm chú vào những vấn đề hạn hẹp mà quên mất những thứ xung quanh</li>\n<li>Liên tục xem xét những thứ đang xảy ra xung quanh mình</li>\n<li>Tổng hợp những vấn đề nhỏ sẽ bẻ gãy tinh thần và đội nhóm</li>\n<li>Câu chuyện: nếu bỏ con ếch vào nồi nước sôi, nó sẽ nhảy ra ngay. Nhưng khi bỏ nó vào nồi nước lạnh và đun nóng từ từ, nó sẽ không nhận ra sự thay đổi và từ từ bị luộc chín</li>\n</ul>\n<p><strong>Lời khuyên thứ 7: Luôn giữ bức tranh lớn trong đầu</strong></p>\n<h2 id=\"mcetoc_1e493jaj40\">Một chương trình đủ tốt</h2>\n<ul>\n<li>Trong môi trường thực tế: thời gian, công nghệ, những thói quen sẽ gây áp lực khi bạn xây dựng chương trình, nên khó có thể đạt được một chương trình hoàn hảo</li>\n<li>Bạn có thể đặt nguyên tắc chỉ cần xây dựng một chương trình đủ tốt, tốt cho người dùng, cho những người bảo trì, cho nhẹ tâm trí của bạn</li>\n<li>Đủ tốt có nghĩa là phải đạt được những yêu cầu của người dùng, vấn đề tốc độ, an toàn, bảo mật được đảm bảo theo tiêu chuẩn</li>\n<li>Nên ủng hộ việc cho phép người dùng tham gia vào việc quyết định những gì cần hoàn thành một cách đủ tốt, và làm vào khi nào</li>\n<li>Đối với một sản phẩm mới, sẽ có những giới hạn khác nhau, bộ phận quảng bá sản phẩm sẽ có nhiều những hứa hẹn, người dùng sẽ có những kế hoạch riêng dựa vào ngày ra mắt của sản phẩm, công ty của bạn sẽ có giới hạn về dòng tiền. Nên cần tính đó là những yêu cầu từ người dùng, không nên dành thời gian để xây dựng những chức năng mới hoặc dọn dẹp code trước khi hoàn thành những yêu cầu đó</li>\n<li>Phạm vi và chất lượng cần được nêu ra trong requirement xây dựng hệ thống</li>\n</ul>\n<p><strong>Lời khuyên thứ 8: Chất lượng sản phẩm nên được tính là một requirement</strong></p>\n<ul>\n<li>Người dùng thường lựa chọn sử dụng một sản phẩm có một vài khiếm khuyết chấp nhận được, thay vì phải chờ thêm 1 năm để có một sản phẩm hoàn hảo</li>\n<li>Một chương trình ngon lành hôm nay sẽ tốt hơn ảo tưởng cho một chương trình hoàn hảo ở tương lai</li>\n<li>Tốt hơn bạn nên cho người dùng vọc chương trình của bạn sớm, những phản hồi của họ có thể là kim chỉ nam cho giải pháp của bạn tốt hơn</li>\n<li>Biết điểm dừng: đừng quá bày vẽ, đừng tinh lọc quá kĩ lưỡng, vì nó có thể làm hỏng một chương trình tốt. Có thể nó không hoàn hảo, và có thể chẳng bao giờ hoàn hảo.</li>\n</ul>\n<h2 id=\"mcetoc_1e4e9n9140\">Danh mục tri thức</h2>\n<ul>\n<li>Kiến thức và kinh nghiệm là những tài sản quan trọng</li>\n<li>Nhưng những điều đó có thể lỗi thời, làm ảnh hưởng đến khách hàng và doanh nghiệp của bạn</li>\n<li>Nên cần quản lý danh mục tri thức tương tự như việc quản lý danh mục đầu tư\n<ul>\n<li>Nhà đầu tư nghiêm túc thường đầu tư một cách định kỳ - như một thói quen</li>\n<li>Đa dạng hóa là chìa khóa cho sự thành công dài hạn</li>\n<li>Nhà đầu tư thông minh biết cân bằng giữa những danh mục đầu tư phòng thủ và những danh mục có rủi ro cao</li>\n<li>Mua giá thấp và bán giá cao để sinh lời tốt nhất</li>\n<li>Danh mục được xem xét và tái cân bằng theo chu kỳ</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"mcetoc_1e4eb0ach1\">Đầu tư định kỳ</h3>\n<ul>\n<li>Đầu tư một cách cố định</li>\n<li>Sắp xếp thời gian và địa điểm, một nơi không ai làm phiền</li>\n</ul>\n<h3 id=\"mcetoc_1e4eb0j1v2\">Đa dạng hóa</h3>\n<ul>\n<li>Bạn biết càng nhiều, bạn càng có giá trị</li>\n<li>Căn bản nhất: nắm rõ trong lòng bàn tay những công nghệ mà bạn làm việc hằng ngày</li>\n<li>Công nghệ thay đổi nhanh và liên tục, nên việc biết nhiều công nghệ giúp bạn dễ dàng điều chỉnh cho phù hợp với xu thế</li>\n<li>Đừng quên những kỹ năng khác ngoài phạm vi kỹ thuật</li>\n</ul>\n<h3 id=\"mcetoc_1e4eb0vba3\">Quản lý rủi ro</h3>\n<ul>\n<li>Cũng giống như đầu tư, có những công nghệ mang tính an toàn, số khác có nguy cơ cao, nhưng mang lại kết quả cao</li>\n</ul>\n<h3 id=\"mcetoc_1e4eb190j4\">Mua thấp, bán cao</h3>\n<ul>\n<li>Học một công nghệ mới nổi trước khi nó trở nên phổ biến sẽ mang cho bạn nguồn lợi cao</li>\n<li>VD tìm hiểu Java khi nó mới được ra đời và chưa phổ biến là một canh bạc, nhưng những người tiên phong sẽ thu được lợi lớn khi nó đã trở thành tiêu chuẩn trong ngành</li>\n</ul>\n<h3 id=\"mcetoc_1e4eb1l7g5\">Xem xét và tái cân bằng</h3>\n<ul>\n<li>Phần mềm là một ngành năng động, công nghệ bạn biết trước đó một vài tháng, có thể sau đó không còn ai quan tâm đến nó</li>\n<li>Cần tái cân bằng, bỏ đi những công nghệ không còn sức sống trên thị trường nữa</li>\n</ul>\n<p>Nhưng điều quan trọng nhất là:</p>\n<p><strong>Lời khuyên thứ 9: Đầu tư định kỳ vào danh mục tri thức của bạn</strong></p>\n<h3 id=\"mcetoc_1e4r74lt90\">Những mục tiêu</h3>\n<ul>\n<li>Học một ngôn ngữ mới mỗi năm: một vấn đề, mỗi ngôn ngữ có thể giải quyết một cách khác nhau. Đây là cách để mở rộng tư duy của bạn. Đọc code các phần mềm nguồn mở sẽ giúp bạn rất nhiều trong việc này.</li>\n<li>Đọc một cuốn sách kỹ thuật mỗi tháng: mặc dù nguồn bài viết và các câu trả lời ngắn rất đa dạng trên mạng, nhưng để có thể hiểu sâu, bạn cần những cuốn sách dài dòng. Hãy tìm đọc những loại sách kỹ thuật liên quan đến dự án của bạn, tạo thói quen đọc một cuốn mỗi tháng. Một khi đã thành thục, hãy chuyển qua học những loại kỹ thuật khác.</li>\n<li>Và đọc những loại sách khác: nên nhớ rằng máy tính được sử dụng bởi con người, và bạn là người làm thỏa mãn những người đó, nên đây là kỹ năng bạn nên rèn luyện</li>\n<li>Tham gia vào các lớp học: tìm những khóa học bạn thấy hứng thú xung quanh nơi bạn ở, hoặc trên mạng</li>\n<li>Tham gia vào nhóm: sự cô lập sẽ chặn đứng con đường sự nghiệp của bạn, hãy tìm hiểu thế giới bên ngoài đang làm gì, và chủ động giao lưu</li>\n<li>Thử nghiệm bản thân ở những môi trường mới: nếu bạn chỉ làm trên Windows, hãy thử trên những môi trường khác như Linux ...</li>\n<li>Không bỏ lỡ: năng đọc nhưng tin tức công nghệ là một cách để biết được kinh nghiệm của những người khác</li>\n</ul>\n<h3 id=\"mcetoc_1e4r755bd1\">Cơ hội học hỏi</h3>\n<ul>\n<li>Khi bạn có một câu hỏi về kỹ thuật và bạn không có câu trả lời chính xác, đừng dừng lại ở đó, hãy đi tìm ra câu trả lời cuối cùng</li>\n<li>Đừng để thời gian chết, luôn có kế hoạch cho việc học hỏi</li>\n</ul>\n<h3 id=\"mcetoc_1e4r7i50l2\">Suy nghĩ phản biện</h3>\n<ul>\n<li>Suy nghĩ thấu đáo về những gì bạn nghe hoặc thấy, bảo đảm những gì bạn biết phải là thông tin chính xác, không bị nhào nặn bởi trào lưu hay cá nhân nào đó</li>\n<li>Ở một thế giới mà hầu hết mọi thứ có thể mua bằng tiền thì bạn hãy cẩn thận với những kết quả tìm kiếm</li>\n</ul>\n<p><strong>Lời khuyên thứ 10: Suy nghĩ thấu đáo về những điều bạn nghe và thấy</strong></p>\n<p>Một số câu hỏi có thể hỗ trợ cho việc này</p>\n<ul>\n<li>\"Hỏi \"Tại sao?\" 5 lần\" : để biết được nguồn gốc của vấn đề</li>\n<li>\"Điều này làm lợi cho ai?\" : nghe có vẻ thô, nhưng lợi ích tài chính có thể là điều cần phải làm rõ</li>\n<li>\"Ngữ cảnh là gì\" : cần phải phân tích vấn đề trong ngữ cảnh nó xảy ra, vì một giải pháp cho tất cả thường là không thực tế. Ví dụ như những cuốn sách dạy \"best practice\", tốt cho ai ? điều kiện tiên quyết là gì? hậu quả ngắn, dài hạn là  gì?</li>\n<li>\"Khi nào và ở đâu thì giải pháp này khả thi?\" : trong hoàn cảnh nào thì áp dụng được? có phải là quá trễ / quá sớm để áp dụng? điều gì xảy ra sau đó?</li>\n<li>Tại sao đây lại là vấn đề: có mô hình nào có thể giải thích</li>\n</ul>\n<h2 id=\"mcetoc_1e52qg4f00\">Giao tiếp</h2>\n<ul>\n<li>Điều quan trọng không chỉ ở những điều bạn biết, mà còn là cách bạn truyền tải nó</li>\n<li>Một ngày làm việc của dev có rất nhiều khoảnh khắc cần phải giao tiếp với khách hàng, đồng nghiệp, trình bày ý tưởng ... nên cần phải làm tốt việc này</li>\n<li>Hãy đối xử với ngôn ngữ bạn dùng để giao tiếp như là một ngôn ngữ lập trình: có DRY không, có dễ dàng thích ứng với sự thay đổi không, có tính tự động hóa ...</li>\n</ul>\n<p><strong>Lời khuyên thứ 11: Ngôn ngữ giao tiếp cũng như ngôn ngữ lập trình</strong></p>\n<h3 id=\"mcetoc_1e52r964h1\">Hiểu thính giả của bạn</h3>\n<ul>\n<li>Bạn giao tiếp với mục đích là truyền tải những nội dung mà bạn hiểu cho người khác, nên bạn cần hiểu rõ nhu cầu, mối quan tâm, và khả năng của những người nghe bạn nói</li>\n<li>Cho dù hình thức giao tiếp có thế nào, điều quan trọng là tiếp nhận phản hồi. Hãy chủ động trong việc xin phản hồi.</li>\n<li>\"Ý nghĩa của cuộc trao đổi nằm ở những phản hồi bạn nhận được\"</li>\n</ul>\n<h3 id=\"mcetoc_1e52r9jn52\">Biết mình nên nói những gì</h3>\n<ul>\n<li>Chuẩn bị cho những gì bạn muốn nói</li>\n<li>Viết một dàn bài và tự hỏi bản thân: \"Nội dung này có truyền tải được những gì tôi muốn nói và họ có thể hiểu được?\". Hãy trui rèn đến khi bạn thỏa mãn được câu hỏi đó</li>\n<li>Điều này cũng áp dụng cho những cuộc họp, hoặc gặp mặt khách hàng</li>\n</ul>\n<h3 id=\"mcetoc_1e52ra0jd3\">Chọn thời điểm</h3>\n<ul>\n<li>Ngoài việc hiểu được thính giả của bạn cần nghe gì, cần phải biết được ưu tiên của họ là gì</li>\n<li>Thời điểm nói cần phải phù hợp, tương tự với nội dung bạn nói</li>\n<li>Đôi lúc chỉ cần đặt câu hỏi \"Đây có phải là thời điểm tốt để nói về ...\"</li>\n</ul>\n<h3 id=\"mcetoc_1e52ra7cu4\">Chọn cách thức</h3>\n<ul>\n<li>Chọn cách thức truyền tải phù hợp với thính giả</li>\n<li>Có những người chỉ muốn tóm tắt những điểm chính yếu, một số muốn một cuộc trao đổi dài trước khi vào đề</li>\n<li>Trình độ của họ trong lĩnh vực cần trao đổi là gì? Chuyên gia hay mới vào nghề? Nếu không chắc, phải hỏi</li>\n</ul>\n<h3 id=\"mcetoc_1e52ravpo5\">Trình bày tài liệu chỉnh chu</h3>\n<ul>\n<li>Hiện nay có rất nhiều phần mềm để hỗ trợ làm tài liệu, nên không lý do gì mà bạn có thể tạo ra một tài liệu xấu xí</li>\n<li>Kiểm tra chính tả, tự động sau đó bằng mắt</li>\n</ul>\n<h3 id=\"mcetoc_1e52rco236\">Cho phép người đọc tham gia vào việc chuẩn bị</h3>\n<ul>\n<li>Nếu có thể, cho phép những người đọc xem những bản nháp của tài liệu và nhận phản hồi từ họ</li>\n<li>Bạn có thể sẽ có mối quan hệ tốt hơn, và tài liệu có thể sẽ chỉnh chu hơn</li>\n</ul>\n<h3 id=\"mcetoc_1e52rd93j7\">Biết lắng nghe</h3>\n<ul>\n<li>Để người khác lắng nghe bạn thì bạn phải lắng nghe họ trước</li>\n<li>Khuyến khích mọi người nói chuyện và đặt câu hỏi, hoặc mời họ trình bày lại nội dung cuộc họp theo ý hiểu của họ</li>\n<li>Biến cuộc họp thành một cuộc trao đổi, thì quan điểm của bạn sẽ được khẳng định hiệu quả hơn</li>\n</ul>\n<h3 id=\"mcetoc_1e52rebu68\">Trả lời thắc mắc</h3>\n<ul>\n<li>Nếu bạn hỏi ai đó, và họ không trả lời, bạn sẽ thấy họ thật bất lịch sự</li>\n<li>Nhìn lại bản thân mình, có khi nào bạn cũng như thế? Trong cuộc sống bận rộn, rất dễ để chúng ta quên mất những thắc mắc của người khác</li>\n<li>Luôn trả lời khi ai đó đặt câu hỏi, một câu đơn giản như \"tôi sẽ trả lời bạn sau nhé\" luôn khiến người khác dễ chấp nhận hơn khi bạn chậm trễ, và tạo cảm giác bạn không quên họ</li>\n</ul>\n<p><strong>Lời khuyên thứ 12: Giao tiếp tốt nằm ở cả nội dung và cách bạn truyền tải</strong></p>\n<h3 id=\"mcetoc_1e52rek5v9\">Làm tài liệu</h3>\n<ul>\n<li>Làm tài liệu cũng là một cách trao đổi thông tin</li>\n<li>Đây nên là một phần thiết yếu trong quá trình phát triển phần mềm</li>\n<li>Để không bị trùng lặp hay tốn nhiều thời gian, tài liệu có thể nằm trong code</li>\n<li>Có thể tạo ra tài liệu chỉnh chu bằng cách comment trong code, trên những modules và các function được export</li>\n<li>Những tài liệu không để mô tả API thì chỉ nên ghi lý do phát triển, mục đích tồn tại và điều nó đạt được. Những dòng code đủ để mô tả nó được thực hiện như thế nào, comment thêm chỉ làm trùng lặp và vi phạm nguyên tắc DRY</li>\n</ul>\n<p><strong>Lời khuyên thứ 13: Tài liệu nên xây dựng trong code, tách rời rất dễ làm nó lỗi thời</strong></p>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Tóm tắt sách"
            ],
            "date_published": "2020-03-16T22:12:30+07:00",
            "date_modified": "2020-04-22T21:57:49+07:00"
        },
        {
            "id": "https://khoican.dev/developer-thuc-dung-mo-dau.html",
            "url": "https://khoican.dev/developer-thuc-dung-mo-dau.html",
            "title": "Developer thực dụng - Mở đầu",
            "summary": "Khái niệmThực dụng - pragmatic - tiếng latin là pragmaticus - có nghĩa là \"dân lành nghề\"Bạn, một phần là người lắng nghe, người tư vấn, người diễn dịch, và&hellip;",
            "content_html": "<h2 id=\"mcetoc_1e5kt3buc2\">Khái niệm</h2>\n<ul>\n<li>Thực dụng - pragmatic - tiếng latin là pragmaticus - có nghĩa là \"dân lành nghề\"</li>\n<li>Bạn, một phần là người lắng nghe, người tư vấn, người diễn dịch, và còn là nhà độc tài trong thế giới của riêng mình</li>\n<li>Không có hệ thống, phần mềm nào là tốt nhất, sẽ tùy vào hoàn cảnh, tình huống mà sẽ có hệ thống phù hợp</li>\n<li>Sử dụng phong cách thực dụng, không giới hạn mình vào bất cứ công nghệ nào, có một tầm nhìn kiến thức đủ rộng để chọn lựa được giải pháp tốt nhất cho tình hình cụ thể</li>\n<li>Lý thuyết đi đôi với thực hành sẽ là điểm mạnh của bạn</li>\n</ul>\n<h3 id=\"mcetoc_1e5kt38hm1\">Điều gì làm nên một developer thực dụng</h3>\n<ul>\n<li>Tiếp thu sớm / tiếp thu nhanh: khi có cơ hội thử nghiệm một công nghệ nào đó, bạn nắm bắt nó nhanh chóng và biến những kiến thức đó thành của mình</li>\n<li>Người tò mò: bạn có xu hướng hay đặt ra những câu hỏi</li>\n<li>Suy nghĩ phản biện: khi được bảo bạn cần làm gì, bạn thường tìm hiểu kỹ lý do và ngọn ngành</li>\n<li>Thực tế: bạn nắm bắt gốc rễ của những vấn đề, cho bạn cảm giác về tính thử thách và thời gian giải quyết chúng</li>\n<li>Hiểu biết rộng: bạn chịu khó làm quen với nhiều công nghệ và môi trường hệ thống</li>\n</ul>\n<p><strong>Lời khuyên thứ 1: Hãy quan tâm đến mức độ lành nghề của bạn</strong></p>\n<p><strong>Lời khuyên thứ 2: Hãy suy nghĩ về công việc của bạn</strong></p>\n<ul>\n<li>Đừng làm việc ở chế độ tự động, hãy liên tục suy nghĩ, đánh giá công việc bạn đang làm</li>\n<li>Một cá nhân thực dụng không có nghĩa sẽ làm mất tính gắn kết trong đội nhóm lớn, bởi trong đội nhóm, khi xây dựng một phần nhỏ của hệ thống, cần phải mường tượng được vị trí của nó trong bức tranh lớn (We who cut mere stones must always be envisioning cathedrals)</li>\n<li>Tính thực dụng của developer cần được cải tiến từng bước nhỏ, trong khoảng thời gian dài</li>\n</ul>\n<p> </p>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Tóm tắt sách"
            ],
            "date_published": "2020-02-08T21:39:00+07:00",
            "date_modified": "2020-04-11T22:37:32+07:00"
        },
        {
            "id": "https://khoican.dev/takeaways-the-last-lecture-randy-pausch.html",
            "url": "https://khoican.dev/takeaways-the-last-lecture-randy-pausch.html",
            "title": "The Last Lecture - Randy Pausch",
            "summary": "Short stories of a professor that has an incurable cancer. The book, which you can call a complete transcript of his presentation, cover many moments that affect his life in&hellip;",
            "content_html": "<p id=\"mcetoc_1d92nooau1\">Short stories of a professor that has an incurable cancer. The book, which you can call a complete transcript of his presentation, cover many moments that affect his life in his childhood, university student, work life and relationship. He set his dreams when he was a child, and commit to them since then. A great inspiration for someone who works with computer like me.</p>\n<h2 id=\"mcetoc_1d92nom7u0\">Quotes</h2>\n<h3 id=\"mcetoc_1d92npdml2\">Relationship</h3>\n<ol>\n<li>Don't finish someone's sentences. And talking louder or faster doesn't make your idea any better.</li>\n<li>If you wait long enough, people will surprise and impress you.</li>\n<li>Watch What They Do, <em>Not What They Say</em></li>\n<li>A Bad Apology Is Worse Than No Apology.</li>\n<li>Proper apologies have three parts:\n<ol>\n<li>What I did was wrong</li>\n<li>I feel badly that I hurt you</li>\n<li>How do I make this better?</li>\n</ol>\n</li>\n</ol>\n<h3 id=\"mcetoc_1d92nplf93\">How To Live</h3>\n<ol>\n<li>The brick walls are there for a reason. They're not there to keep us out. The brink walls are there to give us a chance to how how badly we want something.</li>\n<li>Experience is what you get when you didn't get what you wanted.</li>\n<li>Time is all you have. And you may find one day that you have less than you think.</li>\n<li>Luck is indeed where preparation meets opportunity.</li>\n<li><span id=\"reviewTextContainer470406484\" class=\"readable\"><span id=\"freeText17831765479674834442\">Even if in a position of strength, whether at work or in relationships, you have to play fair. Just because you're in a driver's seat, doesn't mean you have to run people over.</span></span></li>\n<li>If your car has a dent, you don't have to have it removed. It could be a statement of who you are. Not everything needs to be fixed.</li>\n<li>Whether you think you can or can't, you're right.</li>\n<li>If I could give three words of advice, they would be \"tell the truth.\" If I got three more words, I'd add: \"All the time.\"</li>\n<li>We cannot change the cards we are dealt, just how we play the hand.</li>\n<li>I mean, I don’t know how <i xmlns=\"http://www.w3.org/1999/xhtml\">not</i> to have fun. I’m dying and I’m having fun. And I’m going to keep having fun every day I have left. Because there’s no other way to play it.</li>\n<li>Am I a fun-loving Tigger or am I a sad-sack Eeyore? Pick a camp. I think it’s clear where I stand on the great Tigger/Eeyore debate.</li>\n<li>Sometimes, all you have to do is ask.</li>\n</ol>\n<h3 id=\"mcetoc_1d92o29vk4\">Work</h3>\n<ol>\n<li><span id=\"reviewTextContainer19929770\" class=\"readable\"><span id=\"freeText14759365834385401636\">A lot of people want a shortcut. I find the best shortcut is the long way, which is basically two words: work hard.</span></span></li>\n<li>Time must be explicitly managed, like money.</li>\n<li>Ask yourself: Are you spending your time on the right things?</li>\n<li>Complaining does not work as a strategy. We all have finite time and energy. Any time we spend whining is unlikely to help us achieve our goals. And it won’t make us happier.</li>\n<li>It’s not how hard you hit. It’s how hard you get hit ...and keep moving forward.</li>\n<li>Adding manpower to a late software project makes it later. (This is now known as “Brooks Law.”)</li>\n</ol>",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
                   "Tóm tắt sách"
            ],
            "date_published": "2019-04-21T15:26:59+07:00",
            "date_modified": "2019-11-20T22:40:51+07:00"
        }
    ]
}
