{
    "version": "https://jsonfeed.org/version/1",
    "title": "Khoi Can Dev",
    "description": "",
    "home_page_url": "https://khoican.dev",
    "feed_url": "https://khoican.dev/feed.json",
    "user_comment": "",
    "author": {
        "name": "Khoi Can Dev"
    },
    "items": [
        {
            "id": "https://khoican.dev/takeaways-the-last-lecture-randy-pausch.html",
            "url": "https://khoican.dev/takeaways-the-last-lecture-randy-pausch.html",
            "title": "Book - The Last Lecture (Randy Pausch)",
            "summary": "Short stories of a professor that has an incurable cancer. The book, which you can call a complete transcript of his presentation, cover many moments that affect his life in&hellip;",
            "content_html": "<p id=\"mcetoc_1d92nooau1\">Short stories of a professor that has an incurable cancer. The book, which you can call a complete transcript of his presentation, cover many moments that affect his life in his childhood, university student, work life and relationship. He set his dreams when he was a child, and commit to them since then. A great inspiration for someone who works with computer like me.</p>\n<h2 id=\"mcetoc_1d92nom7u0\">Quotes</h2>\n<h3 id=\"mcetoc_1d92npdml2\">Relationship</h3>\n<ol>\n<li>Don't finish someone's sentences. And talking louder or faster doesn't make your idea any better.</li>\n<li>If you wait long enough, people will surprise and impress you.</li>\n<li>Watch What They Do, <em>Not What They Say</em></li>\n<li>A Bad Apology Is Worse Than No Apology.</li>\n<li>Proper apologies have three parts:\n<ol>\n<li>What I did was wrong</li>\n<li>I feel badly that I hurt you</li>\n<li>How do I make this better?</li>\n</ol>\n</li>\n</ol>\n<h3 id=\"mcetoc_1d92nplf93\">How To Live</h3>\n<ol>\n<li>The brick walls are there for a reason. They're not there to keep us out. The brink walls are there to give us a chance to how how badly we want something.</li>\n<li>Experience is what you get when you didn't get what you wanted.</li>\n<li>Time is all you have. And you may find one day that you have less than you think.</li>\n<li>Luck is indeed where preparation meets opportunity.</li>\n<li><span id=\"reviewTextContainer470406484\" class=\"readable\"><span id=\"freeText17831765479674834442\">Even if in a position of strength, whether at work or in relationships, you have to play fair. Just because you're in a driver's seat, doesn't mean you have to run people over.</span></span></li>\n<li>If your car has a dent, you don't have to have it removed. It could be a statement of who you are. Not everything needs to be fixed.</li>\n<li>Whether you think you can or can't, you're right.</li>\n<li>If I could give three words of advice, they would be \"tell the truth.\" If I got three more words, I'd add: \"All the time.\"</li>\n<li>We cannot change the cards we are dealt, just how we play the hand.</li>\n<li>I mean, I don’t know how <i xmlns=\"http://www.w3.org/1999/xhtml\">not</i> to have fun. I’m dying and I’m having fun. And I’m going to keep having fun every day I have left. Because there’s no other way to play it.</li>\n<li>Am I a fun-loving Tigger or am I a sad-sack Eeyore? Pick a camp. I think it’s clear where I stand on the great Tigger/Eeyore debate.</li>\n<li>Sometimes, all you have to do is ask.</li>\n</ol>\n<h3 id=\"mcetoc_1d92o29vk4\">Work</h3>\n<ol>\n<li><span id=\"reviewTextContainer19929770\" class=\"readable\"><span id=\"freeText14759365834385401636\">A lot of people want a shortcut. I find the best shortcut is the long way, which is basically two words: work hard.</span></span></li>\n<li>Time must be explicitly managed, like money.</li>\n<li>Ask yourself: Are you spending your time on the right things?</li>\n<li>Complaining does not work as a strategy. We all have finite time and energy. Any time we spend whining is unlikely to help us achieve our goals. And it won’t make us happier.</li>\n<li>It’s not how hard you hit. It’s how hard you get hit ...and keep moving forward.</li>\n<li>Adding manpower to a late software project makes it later. (This is now known as “Brooks Law.”)</li>\n</ol>",
            "image": "https://khoican.dev/media/posts/3/The-Last-Lecture.png",
            "author": {
                "name": "Khoi Can Dev"
            },
            "tags": [
            ],
            "date_published": "2019-04-21T15:26:59+07:00",
            "date_modified": "2019-04-30T13:37:27+07:00"
        }
    ]
}
